Revit 2024 API
ParameterTypeId.Profile2Angle Property
 "Angle"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId Profile2Angle { get; }
Visual Basic
Public Shared ReadOnly Property Profile2Angle As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Profile2Angle {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace